// 存储文章的地方
export const articlesData = [
  {
    id: 1,
    title: "约束与我自认为的自由",
    date: "2026.01.28",
    content: `
      <p>第一篇文章不是刻意，只是分享</p>
      <br>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;必须要承认，我有时很感激成长，不过是多花了点心思，就能够让我自由不少。</p>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;例如说，小时候我在父母身边上学，当休息日时，我的家庭关于我出去玩的时间是从下午一点到下午五点，早出晚归对我的母亲而言，是严厉禁止的，对父亲而言，更是翅膀硬了的代表行为。</p>
      <br>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;但我如今，已经有条件撒谎了，因为高中和大学的就读位置与家有一定距离，我可以欺骗父母，关于我的假期时间安排，至此让我能够与朋友玩的开心，不用为时间而忧愁，我想这也是我讨厌急匆匆做任何事情的原因。</p>
      <br>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;家中从来没有缺少过我什么，只要小小嗔怪一下，就足以拿到，但从高中时我逐渐理解父母工作的身不由己，所以我克制了经常伸出索要的手。</p>
      <br>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;一切的顿悟是从我高中为了赶早上六点半的早读不得不割舍舒适的床榻，为了所谓的好成绩而不得不将自己封闭在教室学习憋闷的学科，也是为了老师眼中的好班级不得不在年级活动上拿出理综试卷拼命刷。我深知我不适合压力式，规则性学习，每当我想要抗议，我的脑海就会浮现，他们会不会也想过短暂的放松自己，但因为我，一刻都不敢停歇，于是我妥协，也成为了就安者，我不会打破这个牢笼，至少这个牢笼。</p>
      <br>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;高中，是没有多余的资金的，所以出去玩得节约，但我从来不是那块料。到大学后，我什么都不缺了，因为环境的原因我爱上了学习，没有对父母的愧疚，至少我在大学花费的时间不是浪费。而父母经济上的支持，我的生活甚至富足起来。我已经能够自由地安排自己的时间。所以我承认，长大真的很好。</p>
      <br>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;撒谎玩乐的一两天，算是我拥有风险偷来的时间。或许对她人仍然是一种约束，但对我来说足够贪婪了，因为我的母亲袒露过，一旦我的生命停止，她也会放弃流动，而她唯一能够阻止意外的发生的方法，就是将我放在身边。所以这种撒谎偷来的时间，越少越好。</p>
      <br>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;其实就是刚刚好的经济，刚刚好的时间和刚刚好的变化构成了我的自由，很平静，连突如其来的情绪也会被抚平。</p>
      <br>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;没有踏入社会，受限还不够多，文字可能会天真，但如果真是这样。</p>
      <br>
      <p>就天真一辈子吧</p>
      `
  },
  {
    id: 2,
    title: "得寸进尺",
    date: "2026.02.07",
    content: `
      <p>我会得寸进尺，这是很糟糕的行为</p>
<br>
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;为什么说得寸进尺？因为一旦发现有任何人在意我，就会希望他把除了必要以外的精力都放在我身上，甚至说得上贪得无厌。</p>
<br>
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;照常来说，会有许多人厌弃、甚至远离这样犹如寄生虫一样的我。但好在，我这样的行为是挑剔的，且万幸是挑剔的。</p>
<br>
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;一眼定情太荒诞，却对本就荒诞的人来说是慰安。所以我总对第一眼喜欢的人格外宽容。从小到大就贯彻这种行为的我，尽管在恨透对方后，仍然会留下一扇虚掩着的大门。在我看来并非什么自讨苦吃，只要我一点一点撒下诱饵，并且让你心知肚明地咬钩，心甘情愿地留在我的身边，视我如毒品般无法摒弃--这也算我得寸进尺的一种。</p>
<br>
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;我对你好，所以你必须在意我。</p>
<br>
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;在高中阶段，我很喜欢一个女生。她看起来单纯、阳光，感觉天生就是一朵被温室教养的花。女生是非多，我也总爱为她打抱不平；到后来，我购买的一切都会分她一半，唯恐她不肯收。我想，上了大学以后定遇不到像她这样的女孩子了，于是我细数，我珍重。实在是太喜欢你，你也着实像我计划中那样依赖着我，所以就连我母亲对我高考最诚挚的祝愿-一个有着逢考必过字样的物件，我也愿与你分享。不过缘分太浅太浅，它让我止步，于是在高考那天让我听见了你对物件的抱怨。很难过，但若你来找寻我，我怕是又要原谅你了。反应过来，连同我的好，竟然也会得寸进尺。</p>
<br>
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;或许我太特殊，也实在是活得不规则。我一定要对方无可救药地依赖我，我才会感到在意；要一些莫名其妙的控制，要一种不言而喻的暗示，要一双柔情似水的目光，要是你，我才会真正感到在意的存在。</p>
<br>
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;你愿意一天陪我两小时，那我一定会要求你明天陪我三个小时、四个小时、更多、最多。若你愿意撒娇索要礼物，那我一定会要求你的索要贵一点、有代表一点、再多一点，让我的爱定要比它更重一点。</p>
<br>
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;对待我，你有多需要我，依赖我，有多么想就这样陪在我的身边，一定要张口告诉我，满足我一点又不止一点的私心。</p>
<br>
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;亲爱的，如果你要娓娓道来，拜托你要恃宠而骄。</p>
<br>
<p>因为对我来说，不过是小猫撒娇</p>
      `
  },

];