// 存储文章的地方
export const articlesData = [
    {
        id: 1,
        title: "约束与我自认为的自由",
        date: "2026.01.28",
        content: `
      <p>第一篇文章不是刻意，只是分享</p>
      <br>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;必须要承认，我有时很感激成长，不过是多花了点心思，就能够让我自由不少。</p>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;例如说，小时候我在父母身边上学，当休息日时，我的家庭关于我出去玩的时间是从下午一点到下午五点，早出晚归对我的母亲而言，是严厉禁止的，对父亲而言，更是翅膀硬了的代表行为。</p>
      <br>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;但我如今，已经有条件撒谎了，因为高中和大学的就读位置与家有一定距离，我可以欺骗父母，关于我的假期时间安排，至此让我能够与朋友玩的开心，不用为时间而忧愁，我想这也是我讨厌急匆匆做任何事情的原因。</p>
      <br>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;家中从来没有缺少过我什么，只要小小嗔怪一下，就足以拿到，但从高中时我逐渐理解父母工作的身不由己，所以我克制了经常伸出索要的手。</p>
      <br>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;一切的顿悟是从我高中为了赶早上六点半的早读不得不割舍舒适的床榻，为了所谓的好成绩而不得不将自己封闭在教室学习憋闷的学科，也是为了老师眼中的好班级不得不在年级活动上拿出理综试卷拼命刷。我深知我不适合压力式，规则性学习，每当我想要抗议，我的脑海就会浮现，他们会不会也想过短暂的放松自己，但因为我，一刻都不敢停歇，于是我妥协，也成为了就安者，我不会打破这个牢笼，至少这个牢笼。</p>
      <br>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;高中，是没有多余的资金的，所以出去玩得节约，但我从来不是那块料。到大学后，我什么都不缺了，因为环境的原因我爱上了学习，没有对父母的愧疚，至少我在大学花费的时间不是浪费。而父母经济上的支持，我的生活甚至富足起来。我已经能够自由地安排自己的时间。所以我承认，长大真的很好。</p>
      <br>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;撒谎玩乐的一两天，算是我拥有风险偷来的时间。或许对她人仍然是一种约束，但对我来说足够贪婪了，因为我的母亲袒露过，一旦我的生命停止，她也会放弃流动，而她唯一能够阻止意外的发生的方法，就是将我放在身边。所以这种撒谎偷来的时间，越少越好。</p>
      <br>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;其实就是刚刚好的经济，刚刚好的时间和刚刚好的变化构成了我的自由，很平静，连突如其来的情绪也会被抚平。</p>
      <br>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;没有踏入社会，受限还不够多，文字可能会天真，但如果真是这样。</p>
      <br>
      <p>就天真一辈子吧</p>
      
      `
    },
   
];